 &НаКлиенте
 Процедура ПересчитатьСуммуТекущейСтроки()
	 
	 ТекущаяСтрока = Элементы.Работы.ТекущиеДанные;
	 
	 Если Не ЗначениеЗаполнено(ТекущаяСтрока.Количество) Тогда
		 ТекущаяСтрока.Сумма = 0;
		 Возврат;
	 КонецЕсли;
	 
	 Если Не ЗначениеЗаполнено(ТекущаяСтрока.Цена) Тогда
		 ТекущаяСтрока.Сумма = 0;
		 Возврат;
	 КонецЕсли;
	 
	 ТекущаяСтрока.Сумма =
	 ТекущаяСтрока.Количество *
	 ТекущаяСтрока.Цена;
	 
 КонецПроцедуры
 
 
 
 
 
 &НаСервереБезКонтекста
 Функция ПолучитьЦенуВидаРаботы(ВидРаботы)
	 
	 ОбъектВидаРаботы = ВидРаботы.ПолучитьОбъект();
	 
	 Возврат ОбъектВидаРаботы.Цена;
	 
 КонецФункции        
 
 &НаКлиенте
 Процедура РаботыВидРаботыПриИзменении(Элемент)
	 
	 ТекущаяСтрока = Элементы.Работы.ТекущиеДанные;
	 
	 Если ЗначениеЗаполнено(ТекущаяСтрока.ВидРаботы) Тогда
		 
		 ТекущаяСтрока.Цена =
		 ПолучитьЦенуВидаРаботы(
		 ТекущаяСтрока.ВидРаботы
		 );
		 
		 Если Не ЗначениеЗаполнено(ТекущаяСтрока.Количество) Тогда
			 ТекущаяСтрока.Количество = 1;
		 КонецЕсли;
		 
		 ПересчитатьСуммуТекущейСтроки();
		 
	 КонецЕсли;
	 
 КонецПроцедуры
 
 &НаКлиенте
 Процедура РаботыКоличествоПриИзменении(Элемент)
	 
	 ПересчитатьСуммуТекущейСтроки();
	 
 КонецПроцедуры
 
 &НаКлиенте
 Процедура РаботыЦенаПриИзменении(Элемент)
	 
	 ПересчитатьСуммуТекущейСтроки();
	 
 КонецПроцедуры
 
 &НаКлиенте
 Процедура ЗаявкаПриИзменении(Элемент)
	 ЗаполнитьРаботыПоЗаявке();
 КонецПроцедуры 
 
 
 &НаСервере
 Процедура ЗаполнитьРаботыПоЗаявке()
	 
	 Если Не ЗначениеЗаполнено(Объект.Заявка) Тогда
		 Возврат;
	 КонецЕсли;
	 
	 ЗаявкаОбъект = Объект.Заявка.ПолучитьОбъект();
	 
	 Объект.Сотрудник = ЗаявкаОбъект.Ответственный;
	 
	 Объект.Работы.Очистить();
	 
	 Для Каждого СтрокаЗаявки Из ЗаявкаОбъект.Работы Цикл
		 
		 НоваяСтрока = Объект.Работы.Добавить();
		 
		 НоваяСтрока.ВидРаботы = СтрокаЗаявки.ВидРаботы;
		 НоваяСтрока.Количество = СтрокаЗаявки.Количество;
		 НоваяСтрока.Цена = СтрокаЗаявки.Цена;
		 НоваяСтрока.Сумма = СтрокаЗаявки.Сумма;
		 
	 КонецЦикла;
	 
 КонецПроцедуры